Revit 2027 API
StairsRun.GetStairs Method
 Returns the stairs to which the stairs run belongs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Stairs GetStairs()
Public Function GetStairs As Stairs
public:
Stairs^ GetStairs()
member GetStairs : unit -> Stairs
Return Value
Stairs
 The stairs to which the stairs run belongs.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace